# Aula 2 - Preparação e Limpeza de Dados

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("../data/processed/inicial.csv")

In [3]:
df.isnull()

,ano,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [4]:
df.isnull().sum()

ano                     10
nivel_experiencia        0
tipo_emprego             0
cargo                    0
salario                  0
moeda_salario            0
salario_em_usd           0
residencia_empregado     0
taxa_remoto              0
local_empresa            0
tamanho_empresa          0
dtype: int64

In [5]:
df['ano'].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [6]:
df[df.isnull().any(axis=1)]

,ano,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
5588,NaN,Sênior,Tempo Integral,Product Manager,184500,USD,184500,US,Presencial,US,Médio
59692,NaN,Pleno,Tempo Integral,Engineer,110000,USD,110000,DE,Presencial,DE,Médio
59710,NaN,Júnior,Tempo Integral,Data Scientist,208800,USD,208800,US,Presencial,US,Médio
59759,NaN,Sênior,Tempo Integral,Software Engineer,135000,USD,135000,US,Presencial,US,Médio
59789,NaN,Sênior,Tempo Integral,Engineer,112000,USD,112000,US,Presencial,US,Médio
131000,NaN,Sênior,Tempo Integral,Machine Learning Engineer,163800,USD,163800,US,Presencial,US,Médio
131006,NaN,Sênior,Tempo Integral,Data Analytics Manager,204500,USD,204500,US,Presencial,US,Médio
133054,NaN,Júnior,Tempo Integral,Data Scientist,40000,USD,40000,JP,Remoto,MY,Grande
133281,NaN,Pleno,Tempo Integral,Machine Learning Engineer,180000,PLN,46597,PL,Remoto,PL,Grande
133317,NaN,Pleno,Tempo Integral,Data Scientist,130000,USD,130000,US,Híbrido,US,Grande

In [7]:
df_salarios = pd.DataFrame({
    'nome' : ['João', 'Maria', 'José', 'Ana', 'Pedro'],
    'salario' : [4000, np.nan, 5000, np.nan, np.nan]
})

df_salarios['salario_media'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2))
df_salarios['salario_mediana'] = df_salarios['salario'].fillna(df_salarios['salario'].median())

df_salarios

    nome  salario  salario_media  salario_mediana
0   João   4000.0         4000.0           4000.0
1  Maria      NaN         4500.0           4500.0
2   José   5000.0         5000.0           5000.0
3    Ana      NaN         4500.0           4500.0
4  Pedro      NaN         4500.0           4500.0

In [8]:
df_temperaturas = pd.DataFrame({
    'Dia' : ['Segunda', 'Terça', 'Quarta', 'Quinta', 'Sexta'],
    'Temperatura' : [30, np.nan, np.nan, 28, 27]
})

df_temperaturas["preenchido_ffill"] = df_temperaturas['Temperatura'].ffill()
df_temperaturas

       Dia  Temperatura  preenchido_ffill
0  Segunda         30.0              30.0
1    Terça          NaN              30.0
2   Quarta          NaN              30.0
3   Quinta         28.0              28.0
4    Sexta         27.0              27.0

In [9]:
df_temperaturas = pd.DataFrame({
    'Dia' : ['Segunda', 'Terça', 'Quarta', 'Quinta', 'Sexta'],
    'Temperatura' : [30, np.nan, np.nan, 28, 27]
})

df_temperaturas["preenchido_bfill"] = df_temperaturas['Temperatura'].bfill()
df_temperaturas

       Dia  Temperatura  preenchido_bfill
0  Segunda         30.0              30.0
1    Terça          NaN              28.0
2   Quarta          NaN              28.0
3   Quinta         28.0              28.0
4    Sexta         27.0              27.0

In [10]:
df_cidades = pd.DataFrame({
    'Nome' : ['José', 'Pietro', 'Gianna', 'Helena', 'Inácio'],
    'Cidade' : ['São Paulo', 'Rio de Janeiro', np.nan, 'Porto Alegre', np.nan] # Corrected np.nam to np.nan
})

df_cidades['cidade_preenchida'] = df_cidades['Cidade'].fillna('Não informado') # Moved this line outside the DataFrame constructor

df_cidades

     Nome          Cidade cidade_preenchida
0    José       São Paulo         São Paulo
1  Pietro  Rio de Janeiro    Rio de Janeiro
2  Gianna             NaN     Não informado
3  Helena    Porto Alegre      Porto Alegre
4  Inácio             NaN     Não informado

In [11]:
df_limpo = df.dropna()
df_limpo.isnull().sum()

ano                     0
nivel_experiencia       0
tipo_emprego            0
cargo                   0
salario                 0
moeda_salario           0
salario_em_usd          0
residencia_empregado    0
taxa_remoto             0
local_empresa           0
tamanho_empresa         0
dtype: int64

In [12]:
df_limpo.head()

,ano,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio
4,2025.0,Júnior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   ano                   133339 non-null  float64
 1   nivel_experiencia     133349 non-null  object
 2   tipo_emprego          133349 non-null  object
 3   cargo                 133349 non-null  object
 4   salario               133349 non-null  int64
 5   moeda_salario         133349 non-null  object
 6   salario_em_usd        133349 non-null  int64
 7   residencia_empregado  133349 non-null  object
 8   taxa_remoto           133349 non-null  object
 9   local_empresa         133349 non-null  object
 10  tamanho_empresa       133349 non-null  object
dtypes: float64(1), int64(2), object(8)
memory usage: 11.2+ MB

In [14]:
df_limpo = df_limpo.assign(ano = df_limpo['ano'].astype('int64'))
df_limpo.head()

,ano,nivel_experiencia,tipo_emprego,cargo,salario,moeda_salario,salario_em_usd,residencia_empregado,taxa_remoto,local_empresa,tamanho_empresa
0,2025,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio
1,2025,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio
4,2025,Júnior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio

In [15]:
df.to_csv('../data/processed/data-salarios.csv', index=False)